# ==========================================
# Этап 1: Сборка (Builder)
# ==========================================
# Используем ту же версию Go, что и в go.mod
FROM golang:1.25-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы зависимостей и скачиваем их
# (это делается отдельным шагом для кэширования слоев Docker)
COPY go.mod go.sum ./
RUN go mod download

# Копируем весь остальной исходный код
COPY . .

# Собираем бинарник.
# CGO_ENABLED=0 отключает зависимость от системных C-библиотек (делает бинарник статичным)
# GOOS=linux гарантирует сборку под Linux, даже если ты запускаешь сборку на Windows/Mac
RUN CGO_ENABLED=0 GOOS=linux go build -o luna-api ./main.go

# ==========================================
# Этап 2: Финальный образ (Production)
# ==========================================
FROM alpine:latest

# Добавляем сертификаты (для внешних HTTPS запросов) и таймзоны
RUN apk --no-cache add ca-certificates tzdata

WORKDIR /app

# Копируем готовый бинарник из первого этапа
COPY --from=builder /app/luna-api .

# Создаем пустые директории под конфиги и ключи
# (в них будут монтироваться volumes из docker-compose)
RUN mkdir -p configs certs

# Открываем порты (8080 - API, 9090 - метрики)
EXPOSE 8080 9090

# Запускаем наше приложение
CMD ["./luna-api"]